ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
/*
 * hovercar-gd32 - 串口调试模块
 * 用于输出调试信息和接收命令
 */

#include "defines.h"
#include "gd32f10x.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "firmware_api.h"
#include "buzzer.h"

// ============================================
// 全局变量
// ============================================

// 串口接收缓冲区
static uint8_t rx_buffer[256];
static uint16_t rx_index = 0;
static uint16_t rx_length = 0;
static FlagStatus rx_ready = RESET;
static uint32_t rx_timestamp = 0;  // 接收时间戳

// 串口发送缓冲区
static uint8_t tx_buffer[256];
static uint16_t tx_index = 0;
static uint16_t tx_length = 0;

static void process_command(const char* command);

// 外部声明（来自 main.c 和 bldc.c）
extern VehicleControl vehicle;
extern uint8_t system_state;
extern MotorState left_motor;
extern MotorState right_motor;
extern adc_buf_t adc_buffer;

// ============================================
// 公共函数
// ============================================
#include <stdint.h>

void USART_Init(uint32_t baudrate)
{
    baudrate=baudrate; // 避免未使用参数的编译警告
    /* 1. 对应 a1: set *(uint32_t*)0x40021018 = *(uint32_t*)0x40021018 | 0x00000008 */
    /* 作用: 使能 GPIOB 时钟 (APB2ENR Bit 3) */
    *(volatile uint32_t*)0x40021018 |= 0x00000008;

    /* 2. 对应 a1: set *(uint32_t*)0x4002101C = *(uint32_t*)0x4002101C | 0x00040000 */
    /* 作用: 使能 USART3 时钟 (APB1ENR Bit 18) */
    *(volatile uint32_t*)0x4002101C |= 0x00040000;

    /* 3. 对应 a1: set *(uint32_t*)0x4000480C = 0x0000 */
    /* 作用: 清除 USART3_CR1，关闭串口准备配置 */
    *(volatile uint32_t*)0x4000480C = 0x0000;

    /* 4. 对应 a1: set *(uint32_t*)0x40010C04 = (*(uint32_t*)0x40010C04 & ~0xFFFF00) | 0x4B00 */
    /* 作用: 配置 GPIOB_CRH。PB10配置为复用推挽输出(0xB)，PB11配置为浮空输入(0x4) */
    *(volatile uint32_t*)0x40010C04 = (*(volatile uint32_t*)0x40010C04 & ~0xFFFF00) | 0x4B00;

    /* 5. 对应 a1: set *(uint32_t*)0x40004808 = 312 */
    /* 作用: 写入波特率寄存器 (BRR)。 */
    /* 注意：a1 中直接写死了 312 (通常对应 36MHz PCLK 下的 115200 波特率)。*/
    /* 为了严格对应，这里默认写入 312。若要让 baudrate 参数生效，可替换为: 
       *(volatile uint32_t*)0x40004808 = (36000000 + baudrate / 2) / baudrate; */
    *(volatile uint32_t*)0x40004808 = 312; 

    /* 6. 对应 a1: set *(uint32_t*)0x4000480C = 0x200C */
    /* 作用: 配置 USART3_CR1，开启 USART(Bit13), TX(Bit3), RX(Bit2) */
    /* 注意：0x200C = 0x2000(USART_ENABLE) | 0x0008(TX_ENABLE) | 0x0004(RX_ENABLE) */
    /* 需要添加接收中断使能位：Bit5 (RXNEIE) = 0x0020 */
    /* 所以最终值应为：0x202C = 0x2000 | 0x0020 | 0x0008 | 0x0004 */
    *(volatile uint32_t*)0x4000480C = 0x202C;
    
    /* 7. 使能 NVIC 中断 */
    /* 使用 DEBUG_USART_IRQn 宏定义，在 defines.h 中定义为 USART2_IRQn */
    NVIC->ISER[DEBUG_USART_IRQn >> 5] = 1 << (DEBUG_USART_IRQn & 0x1F);
}


/**
 * @brief 发送字符串
 * @param str 要发送的字符串
 */
void USART_SendString(const char* str) {
    if (str == NULL) {
        return;
    }
    
    uint32_t len = strlen(str);
    for (uint32_t i = 0; i < len; i++) {
        usart_data_transmit(DEBUG_USART, (uint8_t)str[i]);
        while (usart_flag_get(DEBUG_USART, USART_FLAG_TBE) == RESET);
    }
}

/**
 * @brief 发送数据
 * @param data 数据指针
 * @param length 数据长度
 */
void USART_SendData(const uint8_t* data, uint16_t length) {
    if (data == NULL || length == 0) {
        return;
    }
    
    for (uint16_t i = 0; i < length; i++) {
        usart_data_transmit(DEBUG_USART, data[i]);
        while (usart_flag_get(DEBUG_USART, USART_FLAG_TBE) == RESET);
    }
}

/**
 * @brief 检查是否有接收数据
 * @return 接收状态
 */
FlagStatus USART_DataAvailable(void) {
    return rx_ready;
}

/**
 * @brief 读取接收数据
 * @param buffer 输出缓冲区
 * @param max_length 最大长度
 * @return 实际读取长度
 */
uint16_t USART_ReadData(uint8_t* buffer, uint16_t max_length) {
    if (buffer == NULL || max_length == 0 || rx_ready == RESET) {
        return 0;
    }
    
    uint16_t length = (rx_length < max_length) ? rx_length : max_length;
    memcpy(buffer, rx_buffer, length);
    
    // 清空缓冲区
    rx_index = 0;
    rx_length = 0;
    rx_ready = RESET;
    
    return length;
}

void USART_ProcessPendingCommand(void) {
    if (rx_ready == RESET) {
        return;
    }

    rx_buffer[rx_length] = '\0';
    process_command((char*)rx_buffer);
    rx_index = 0;
    rx_length = 0;
    rx_ready = RESET;
}

/**
 * @brief 格式化输出
 * @param format 格式字符串
 * @param ... 参数
 */
void USART_Printf(const char* format, ...) {
    char buffer[128];
    va_list args;
    
    va_start(args, format);
    vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);
    
    USART_SendString(buffer);
}

/**
 * @brief 发送调试信息
 * @param info 调试信息结构
 */
void USART_SendDebugInfo(DebugInfo* info) {
    if (info == NULL) {
        return;
    }
    
    char buffer[256];
    snprintf(buffer, sizeof(buffer),
             "State:%d Battery:%.1fV Current:%.1fA Left:%d/%d Right:%d/%d Ctrl:T:%d S:%d\n",
             info->system_state,
             info->battery_voltage,
             info->total_current,
             (int)info->left_speed,
             info->left_hall_state,
             (int)info->right_speed,
             info->right_hall_state,
             info->throttle,
             info->steering);
    
    USART_SendString(buffer);
}

// ============================================
// 内部函数
// ============================================

/**
 * @brief 处理接收到的字符
 * @param ch 接收到的字符
 */
static void process_received_char(uint8_t ch) {
    // 简单的命令行处理
    if (ch == '\r' || ch == '\n') {
        if (rx_index > 0) {
            rx_buffer[rx_index] = '\0';  // 添加字符串结束符
            rx_length = rx_index;
            rx_ready = SET;
            
            // 获取当前时间戳 (毫秒，基于 SysTick)
            // SysTick 配置为 1ms 中断，VAL 寄存器记录当前计数值
            uint32_t ms_counter = (SystemCoreClock / 1000) - SysTick->VAL;
            
            // 立即发送时间戳 echo
            USART_Printf("\r\n[%10u ms] RX: ", ms_counter);
            USART_SendString((char*)rx_buffer);
            USART_SendString("\r\n> ");
        }
        rx_index = 0;
    } else if (ch == 0x08 || ch == 0x7F) {  // 退格或删除
        if (rx_index > 0) {
            rx_index--;
            USART_SendString("\b \b");  // 回显退格
        }
    } else if (rx_index < sizeof(rx_buffer) - 1) {
        rx_buffer[rx_index++] = ch;
        usart_data_transmit(DEBUG_USART, ch);  // 回显字符
        while (usart_flag_get(DEBUG_USART, USART_FLAG_TBE) == RESET);
    }
}

// 命令帮助函数
static int16_t parse_pwm_value(const char* str) {
    int16_t value = atoi(str);
    return CLAMP(value, -1000, 1000);
}





// 解析形如 "PA3" 的引脚描述，返回 1=成功，0=失败
static int parse_pin_string(const char* s, uint32_t* out_port, uint16_t* out_pin) {
    if (!s) return 0;
    // Accept formats: PA3, pa3, A3, a3
    const char* p = s;
    // skip leading spaces
    while (*p == ' ') p++;

    char portch = 0;
    const char* numptr = NULL;
    if ((p[0] == 'P' || p[0] == 'p') && (p[1] >= 'A' && p[1] <= 'z')) {
        portch = p[1];
        numptr = p + 2;
    } else if ((p[0] >= 'A' && p[0] <= 'z')) {
        portch = p[0];
        numptr = p + 1;
    } else {
        return 0;
    }

    if (portch >= 'a' && portch <= 'z') portch -= ('a' - 'A');
    if (portch < 'A' || portch > 'G') return 0;

    int pin = atoi(numptr);
    if (pin < 0 || pin > 15) return 0;

    switch (portch) {
        case 'A': *out_port = (uint32_t)GPIOA; rcu_periph_clock_enable(RCU_GPIOA); break;
        case 'B': *out_port = (uint32_t)GPIOB; rcu_periph_clock_enable(RCU_GPIOB); break;
        case 'C': *out_port = (uint32_t)GPIOC; rcu_periph_clock_enable(RCU_GPIOC); break;
        case 'D': *out_port = (uint32_t)GPIOD; rcu_periph_clock_enable(RCU_GPIOD); break;
        case 'E': *out_port = (uint32_t)GPIOE; rcu_periph_clock_enable(RCU_GPIOE); break;
        default: return 0;
    }

    *out_pin = (uint16_t)(1U << pin);
    return 1;
}

// 读取任意引脚值（原始GPIO读数）并输出
static void cmd_gpio_read(const char* arg) {
    uint32_t port; uint16_t pin;
    if (!parse_pin_string(arg, &port, &pin)) {
        USART_SendString("gpio read usage: gpio read PA3\r\n");
        return;
    }
    uint8_t raw = GPIO_INPUT_BIT_GET((uint32_t)port, pin);
    USART_Printf("GPIO %s: raw=%d (pin mask 0x%04X)\r\n", arg, raw, pin);
}

// 将任意引脚设为输出并写入 0/1
static void cmd_gpio_write(const char* arg, const char* valstr) {
    uint32_t port; uint16_t pin;
    if (!parse_pin_string(arg, &port, &pin)) {
        USART_SendString("gpio write usage: gpio write PA3 1\r\n");
        return;
    }
    int v = atoi(valstr);
    // 配置为推挽输出
    gpio_init((uint32_t)port, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, pin);
    if (v) gpio_bit_set((uint32_t)port, pin); else gpio_bit_reset((uint32_t)port, pin);
    USART_Printf("GPIO %s set to %d\r\n", arg, v ? 1 : 0);
}

static int calculate_pwm_timer_params(int hz, uint32_t* prescaler_out, uint32_t* period_out) {
    if (hz <= 0 || prescaler_out == NULL || period_out == NULL) {
        return 0;
    }

