ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
    uint32_t timer_clock = SYSTEM_CORE_CLOCK;
    uint32_t total_ticks = timer_clock / (uint32_t)hz;
    if (total_ticks == 0) {
        return 0;
    }

    uint32_t prescaler = (total_ticks - 1U) / 0x10000U;
    if (prescaler > 0xFFFFU) {
        return 0;
    }

    uint32_t period = total_ticks / (prescaler + 1U);
    if (period == 0 || period > 0xFFFFU) {
        return 0;
    }

    *prescaler_out = prescaler;
    *period_out = period;
    return 1;
}

// 设置所有可用 PWM 定时器频率和占空比（默认 50%）
static void cmd_pwm_all(const char* hzstr, const char* dutystr) {
    int hz = atoi(hzstr);
    int duty = dutystr ? atoi(dutystr) : 50;
    if (hz <= 0 || duty < 0 || duty > 100) {
        USART_SendString("pwm all usage: pwm all <hz> [duty_percent]\r\n");
        return;
    }

    uint32_t prescaler;
    uint32_t period;
    if (!calculate_pwm_timer_params(hz, &prescaler, &period)) {
        USART_Printf("Requested frequency out of range: %d Hz\r\n", hz);
        return;
    }

    uint32_t pulse = (((uint32_t)period + 1U) * (uint32_t)duty) / 100U;
    if (pulse > period) {
        pulse = period;
    }

    // Ensure timer and GPIO/AF clocks enabled and reset TIM1 as user script
    rcu_periph_reset_enable(RCU_TIMER1RST);
    rcu_periph_reset_disable(RCU_TIMER1RST);
    rcu_periph_clock_enable(RCU_TIMER1);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_AF);
    // Ensure TIM1 uses default AF mapping for its channels
    volatile uint32_t* AFIO_MAPR = (uint32_t*)0x40010004;
    *AFIO_MAPR &= ~(3 << 8);

    timer_parameter_struct timer_init_struct;
    timer_oc_parameter_struct oc_init_struct;

    // 通用定时器初始化结构
    timer_deinit(TIMER1);
    timer_init_struct.prescaler = (uint16_t)prescaler;
    timer_init_struct.alignedmode = TIMER_COUNTER_CENTER_BOTH;
    timer_init_struct.counterdirection = TIMER_COUNTER_UP;
    timer_init_struct.period = (uint16_t)period;
    timer_init_struct.clockdivision = TIMER_CKDIV_DIV1;
    timer_init_struct.repetitioncounter = 0;
    timer_init(TIMER1, &timer_init_struct);

    oc_init_struct.outputstate = TIMER_CCX_ENABLE;
    oc_init_struct.outputnstate = TIMER_CCXN_ENABLE;
    oc_init_struct.ocpolarity = TIMER_OC_POLARITY_HIGH;
    oc_init_struct.ocnpolarity = TIMER_OCN_POLARITY_LOW;
    oc_init_struct.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
    oc_init_struct.ocnidlestate = TIMER_OCN_IDLE_STATE_HIGH;

    timer_channel_output_config(TIMER1, TIMER_CH_1, &oc_init_struct);
    timer_channel_output_config(TIMER1, TIMER_CH_2, &oc_init_struct);
    timer_channel_output_config(TIMER1, TIMER_CH_3, &oc_init_struct);

    timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_PWM1);
    timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_PWM1);
    timer_channel_output_mode_config(TIMER1, TIMER_CH_3, TIMER_OC_MODE_PWM1);

    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, (uint16_t)pulse);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, (uint16_t)pulse);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, (uint16_t)pulse);
    timer_enable(TIMER1);

    // TIM3 CH3
    timer_deinit(TIMER3);
    timer_init_struct.period = (uint16_t)period;
    timer_init(TIMER3, &timer_init_struct);
    timer_channel_output_config(TIMER3, TIMER_CH_3, &oc_init_struct);
    timer_channel_output_mode_config(TIMER3, TIMER_CH_3, TIMER_OC_MODE_PWM1);
    timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_3, (uint16_t)pulse);
    timer_enable(TIMER3);

    // TIM4 CH1, CH3
    timer_deinit(TIMER4);
    timer_init_struct.period = (uint16_t)period;
    timer_init(TIMER4, &timer_init_struct);
    timer_channel_output_config(TIMER4, TIMER_CH_1, &oc_init_struct);
    timer_channel_output_config(TIMER4, TIMER_CH_3, &oc_init_struct);
    timer_channel_output_mode_config(TIMER4, TIMER_CH_1, TIMER_OC_MODE_PWM1);
    timer_channel_output_mode_config(TIMER4, TIMER_CH_3, TIMER_OC_MODE_PWM1);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_1, (uint16_t)pulse);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, (uint16_t)pulse);
    timer_enable(TIMER4);

    USART_Printf("PWM set: %d Hz, duty %d%% (psc=%lu, period=%lu, pulse=%lu)\r\n", hz, duty, prescaler, period, pulse);
}

// 为单个引脚配置 PWM（目前实现 PA3 -> TIM1_CH3）
static void cmd_pwm_pin(const char* pinstr, int hz, int duty) {
    // 1. 解析引脚（保持你的逻辑）
    uint32_t port; uint16_t pin;
    if (!parse_pin_string(pinstr, &port, &pin)) {
        USART_Printf("Unsupported pin: %s\r\n", pinstr);
        return;
    }

    // 严格校验是否为 PA3
    if ((uint32_t)GPIOA != port || pin != GPIO_PIN_3) {
        USART_Printf("pwm pin: only PA3 currently supported\r\n");
        return;
    }

    // 2. 计算定时器参数
    uint32_t prescaler;
    uint32_t period;
    if (!calculate_pwm_timer_params(hz, &prescaler, &period)) {
        USART_Printf("Requested frequency out of range: %d Hz\r\n", hz);
        return;
    }
    uint32_t pulse = (((uint32_t)period + 1U) * (uint32_t)duty) / 100U;

    // 3. 严格按照 GDB 成功的逻辑配置
    // 复位 TIMER1
    rcu_periph_reset_enable(RCU_TIMER1RST);
    rcu_periph_reset_disable(RCU_TIMER1RST);
    
    // 开启时钟
    rcu_periph_clock_enable(RCU_TIMER1);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_AF);
    
    // 清除 AFIO_MAPR 的 Bit 9:8 (TIMER1 重映射控制位)
    volatile uint32_t* AFIO_MAPR = (uint32_t*)0x40010004;
    *AFIO_MAPR &= ~(3 << 8);

    // 4. 配置 PA3 为复用推挽输出 (AF_PP)
    gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_3);

    // 5. 直接寄存器配置，严格匹配 GDB 脚本
    volatile uint32_t* TIMER1_CTL0   = (uint32_t*)(TIMER1 + 0x00);
    volatile uint32_t* TIMER1_SWEVG  = (uint32_t*)(TIMER1 + 0x14);
    volatile uint32_t* TIMER1_CHCTL2 = (uint32_t*)(TIMER1 + 0x20);
    volatile uint32_t* TIMER1_CHCTL1 = (uint32_t*)(TIMER1 + 0x1C);
    volatile uint32_t* TIMER1_CNT    = (uint32_t*)(TIMER1 + 0x24);
    volatile uint32_t* TIMER1_PSC    = (uint32_t*)(TIMER1 + 0x28);
    volatile uint32_t* TIMER1_CAR    = (uint32_t*)(TIMER1 + 0x2C);
    volatile uint32_t* TIMER1_CH3CV  = (uint32_t*)(TIMER1 + 0x40);
    
