ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
    // 设置计数器、预分频器、自动重载值
    *TIMER1_CNT   = 0;
    *TIMER1_PSC   = (uint32_t)prescaler;
    *TIMER1_CAR   = (uint32_t)period;
    *TIMER1_CH3CV = (uint32_t)pulse;
    
    // 配置通道3为PWM模式1
    *TIMER1_CHCTL1 = (*TIMER1_CHCTL1 & ~0xFF) | 0x68;  // CH3配置为PWM模式1
    
    // 使能通道3输出
    *TIMER1_CHCTL2 &= ~(1 << 13);  // 清除CH3N输出使能
    *TIMER1_CHCTL2 |= (1 << 12);   // 设置CH3输出使能
    
    // 生成软件更新事件
    *TIMER1_SWEVG = (1 << 0);
    
    // 使能定时器
    *TIMER1_CTL0 |= (1 << 0);

    USART_Printf("PA3 (TIMER1_CH3) PWM active: %d Hz, duty %d%% (psc=%lu, period=%lu, pulse=%lu)\r\n", 
                 hz, duty, prescaler, period, pulse);
}


/**
 * @brief 处理命令
 * @param command 命令字符串
 */
static void process_command(const char* command) {
    if (command == NULL || strlen(command) == 0) {
        return;
    }
    
    char cmd_copy[256];
    strncpy(cmd_copy, command, sizeof(cmd_copy) - 1);
    cmd_copy[sizeof(cmd_copy) - 1] = '\0';
    
    // 转换为小写以便比较
    for (int i = 0; cmd_copy[i]; i++) {
        if (cmd_copy[i] >= 'A' && cmd_copy[i] <= 'Z') {
            cmd_copy[i] += 32;
        }
    }
    
    // 命令处理
    if (strcmp(cmd_copy, "help") == 0 || strcmp(cmd_copy, "?") == 0) {
        USART_SendString("\r\n=== HOVERCAR SERIAL COMMANDS ===\r\n");
        USART_SendString("Motor Control:\r\n");
        USART_SendString("  motor enable              - Enable motors\r\n");
        USART_SendString("  motor disable             - Disable motors\r\n");
        USART_SendString("  motor left <pwm>          - Set left motor PWM (-1000~1000)\r\n");
        USART_SendString("  motor right <pwm>         - Set right motor PWM (-1000~1000)\r\n");
        USART_SendString("  motor both <pwm>          - Set both motors PWM (-1000~1000)\r\n");
        USART_SendString("  mo <pwm>                  - Open-loop left motor PWM (default left)\r\n");
        USART_SendString("  mo left <pwm>             - Open-loop left motor PWM\r\n");
        USART_SendString("  mo right <pwm>            - Open-loop right motor PWM\r\n");
        USART_SendString("\r\nSystem Status:\r\n");
        USART_SendString("  status                    - Show system status\r\n");
        USART_SendString("  adc                       - Show ADC values\r\n");
        USART_SendString("  battery                   - Show battery voltage\r\n");
        USART_SendString("  current                   - Show motor current\r\n");
        USART_SendString("  speed                     - Show motor speeds\r\n");
        USART_SendString("  hall                      - Show hall sensor states\r\n");
        USART_SendString("\r\nBuzzer Control:\r\n");
        USART_SendString("  beep <n>                  - Beep n times (1-10)\r\n");
        USART_SendString("  buzzer <pattern>          - Play buzzer pattern\r\n");
        USART_SendString("\r\nSystem:\r\n");
        USART_SendString("  reset                     - Reset system\r\n");
        USART_SendString("  help/?                    - Show this help\r\n");
        USART_SendString("================================\r\n");
    }
    
    else if (strncmp(cmd_copy, "motor ", 6) == 0) {
        const char* motor_cmd = command + 6;
        
        if (strncmp(motor_cmd, "enable", 6) == 0) {
            SetMotorsEnable(SET);
            vehicle.enable = SET;
            USART_SendString("Motors enabled\r\n");
        }
        else if (strncmp(motor_cmd, "disable", 7) == 0) {
            SetMotorsEnable(RESET);
            vehicle.enable = RESET;
            USART_SendString("Motors disabled\r\n");
        }
        else if (strncmp(motor_cmd, "left ", 5) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 5);
            SetLeftMotorPWM(pwm);
            USART_Printf("Left motor PWM: %d\r\n", pwm);
        }
        else if (strncmp(motor_cmd, "right ", 6) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 6);
            SetRightMotorPWM(pwm);
            USART_Printf("Right motor PWM: %d\r\n", pwm);
        }
        else if (strncmp(motor_cmd, "both ", 5) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 5);
            SetLeftMotorPWM(pwm);
            SetRightMotorPWM(pwm);
            USART_Printf("Both motors PWM: %d\r\n", pwm);
        }
        else {
            USART_SendString("Motor command: enable|disable|left|right|both\r\n");
        }
    }
    else if (strncmp(cmd_copy, "mo", 2) == 0 && (cmd_copy[2] == ' ' || cmd_copy[2] == '\0')) {
        const char* args = command + 2;
        while (*args == ' ') args++;

        const char* motor = "left";
        const char* pwmstr = NULL;

        if (*args == '\0') {
            USART_SendString("mo usage: mo [left|right] <pwm>\r\n");
            return;
        }

        if ((args[0] == '+' || args[0] == '-' || (args[0] >= '0' && args[0] <= '9'))) {
            pwmstr = args;
        } else {
            if (strncasecmp(args, "left", 4) == 0) {
                motor = "left";
                args += 4;
            } else if (strncasecmp(args, "right", 5) == 0) {
                motor = "right";
                args += 5;
            } else {
                USART_SendString("mo usage: mo [left|right] <pwm>\r\n");
                return;
            }
            while (*args == ' ') args++;
            if (*args == '\0') {
                USART_SendString("mo usage: mo [left|right] <pwm>\r\n");
                return;
            }
            pwmstr = args;
        }

        int16_t pwm = parse_pwm_value(pwmstr);
        motor_pwm_openloop(motor, pwm);
        USART_Printf("Open-loop motor %s PWM: %d\r\n", motor, pwm);
    }

        else if (strncmp(cmd_copy, "gpio ", 5) == 0) {
            const char* args = command + 5;
            while (*args == ' ') args++;
            if (strncasecmp(args, "read ", 5) == 0) {
                const char* pinstr = args + 5;
                while (*pinstr == ' ') pinstr++;
                cmd_gpio_read(pinstr);
            } else if (strncasecmp(args, "write ", 6) == 0) {
                const char* rest = args + 6;
                while (*rest == ' ') rest++;
                // split pin and value
                char pinbuf[16]; int i=0;
                while (*rest && *rest != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *rest++;
                pinbuf[i] = '\0';
                while (*rest == ' ') rest++;
                cmd_gpio_write(pinbuf, rest);
            } else {
                USART_SendString("gpio commands:\r\n  gpio read PA3\r\n  gpio write PA3 1\r\n");
            }
        }
        else if (cmd_copy[0] == 'r' && cmd_copy[1] == ' ') {
            const char* arg = command + 2;
            while (*arg == ' ') arg++;
            char pinbuf[16]; int i=0;
            while (*arg && *arg != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *arg++;
            pinbuf[i] = '\0';
            if (i == 0) {
                USART_SendString("r usage: r PA3 or r A3\r\n");
            } else {
                cmd_gpio_read(pinbuf);
            }
        }
        else if (cmd_copy[0] == 'w' && cmd_copy[1] == ' ') {
            const char* rest = command + 2;
            while (*rest == ' ') rest++;
            char pinbuf[16]; int i=0;
            while (*rest && *rest != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *rest++;
            pinbuf[i] = '\0';
            while (*rest == ' ') rest++;
            if (i == 0 || *rest == 0) {
                USART_SendString("w usage: w PA3 1\r\n");
            } else {
                cmd_gpio_write(pinbuf, rest);
            }
        }
    
    else if (strcmp(cmd_copy, "status") == 0) {
        USART_SendString("\r\n=== SYSTEM STATUS ===\r\n");
        USART_Printf("State: %d (0=Init,1=Ready,2=Running,3=Error)\r\n", system_state);
        USART_Printf("Battery: %.2fV\r\n", vehicle.battery_voltage);
        USART_Printf("Current: %.2fA\r\n", GetTotalCurrent());
        USART_Printf("Left Speed: %.0f RPM, Hall: %d\r\n", GetLeftMotorSpeed(), left_motor.hall_state);
        USART_Printf("Right Speed: %.0f RPM, Hall: %d\r\n", GetRightMotorSpeed(), right_motor.hall_state);
        USART_Printf("Throttle: %d, Steering: %d\r\n", vehicle.throttle, vehicle.steering);
        USART_Printf("Motors Enabled: %s\r\n", vehicle.enable ? "YES" : "NO");
        USART_SendString("====================\r\n");
    }
    
    else if (strcmp(cmd_copy, "adc") == 0) {
        USART_SendString("\r\n=== ADC VALUES ===\r\n");
        USART_Printf("Battery ADC: %d (counts)\r\n", adc_buffer.battery);
        USART_Printf("Current ADC: %d (counts)\r\n", adc_buffer.current);
        USART_Printf("Temp ADC: %d (counts)\r\n", adc_buffer.temp);
        USART_SendString("==================\r\n");
    }
    
