ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
    else if (strcmp(cmd_copy, "battery") == 0) {
        USART_Printf("Battery Voltage: %.2fV\r\n", vehicle.battery_voltage);
        if (vehicle.battery_voltage < BATTERY_DEAD_VOLTAGE) {
            USART_SendString("WARNING: Battery critically low!\r\n");
        } else if (vehicle.battery_voltage < BATTERY_LOW_VOLTAGE) {
            USART_SendString("WARNING: Battery low!\r\n");
        } else {
            USART_SendString("Battery status: Normal\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "current") == 0) {
        float current = GetTotalCurrent();
        USART_Printf("Motor Current: %.2fA\r\n", current);
        if (current > CURRENT_LIMIT) {
            USART_SendString("WARNING: Current exceeds limit!\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "speed") == 0) {
        USART_Printf("Left Motor Speed: %.0f RPM\r\n", GetLeftMotorSpeed());
        USART_Printf("Right Motor Speed: %.0f RPM\r\n", GetRightMotorSpeed());
    }
    
    else if (strncmp(cmd_copy, "pwm ", 4) == 0) {
        const char* args = command + 4;
        while (*args == ' ') args++;
        // args may be: all <hz> [duty]  OR  <pin> [hz] [duty]
        if (strncasecmp(args, "all ", 4) == 0) {
            const char* params = args + 4;
            while (*params == ' ') params++;
            // parse hz and optional duty
            char hzbuf[16] = {0}; int i=0;
            while (*params && *params != ' ' && i < (int)sizeof(hzbuf)-1) hzbuf[i++] = *params++;
            hzbuf[i] = '\0';
            while (*params == ' ') params++;
            const char* dutystr = NULL;
            if (*params) dutystr = params;
            cmd_pwm_all(hzbuf, dutystr);
        } else {
            // treat first token as pin
            char pinbuf[16] = {0}; int i=0;
            const char* p = args;
            while (*p && *p != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *p++;
            pinbuf[i] = '\0';
            while (*p == ' ') p++;
            int hz = 1;
            int duty = 50;
            if (*p) {
                char hzbuf[32] = {0}; int j = 0;
                while (*p && *p != ' ' && j < (int)sizeof(hzbuf) - 1) hzbuf[j++] = *p++;
                hzbuf[j] = '\0';
                if (hzbuf[0]) {
                    hz = atoi(hzbuf);
                }
                while (*p == ' ') p++;
                if (*p) {
                    duty = atoi(p);
                }
            }
            if (pinbuf[0]) cmd_pwm_pin(pinbuf, hz, duty);
            else USART_SendString("pwm commands:\r\n  pwm all <hz> [duty_percent]\r\n  pwm PA3 [hz] [duty_percent]\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "hall") == 0) {
        // 读取原始状态
        uint8_t left_hall_raw = read_hall_sensors(LEFT_HALL_U_PORT, LEFT_HALL_U_PIN, LEFT_HALL_V_PORT, LEFT_HALL_V_PIN, LEFT_HALL_W_PORT, LEFT_HALL_W_PIN);
        uint8_t right_hall_raw = read_hall_sensors(RIGHT_HALL_U_PORT, RIGHT_HALL_U_PIN, RIGHT_HALL_V_PORT, RIGHT_HALL_V_PIN, RIGHT_HALL_W_PORT, RIGHT_HALL_W_PIN);
        
        // 转换为高电平有效
        uint8_t left_h = (~left_hall_raw) & 0x07;
        uint8_t right_h = (~right_hall_raw) & 0x07;
        
        USART_SendString("\r\n=== HALL SENSOR STATUS SUMMARY ===\r\n");
        // 格式：[L: 状态(二进制) | 原始值 | 位置] [R: 状态(二进制) | 原始值 | 位置]
        USART_Printf("LEFT  Hall: 0b%d%d%d (Raw:0x%02X) | Pos: %d\r\n", 
                     (left_h>>2)&1, (left_h>>1)&1, (left_h&1), left_hall_raw, left_motor.position);
        USART_Printf("RIGHT Hall: 0b%d%d%d (Raw:0x%02X) | Pos: %d\r\n", 
                     (right_h>>2)&1, (right_h>>1)&1, (right_h&1), right_hall_raw, right_motor.position);
        
        // 仅在出现故障状态（000 或 111）时打印警告
        if (left_h == 0x00 || left_h == 0x07) {
            USART_SendString("!! WARNING: Left Hall Fault (000/111 detected)\r\n");
        }
        if (right_h == 0x00 || right_h == 0x07) {
            USART_SendString("!! WARNING: Right Hall Fault (000/111 detected)\r\n");
        }
    }
    
    else if (strncmp(cmd_copy, "beep", 4) == 0) {
        const char* param = command + 4;
        while (*param == ' ') param++;
        int beeps = atoi(param);
        if (beeps > 0 && beeps <= 10) {
            for (int i = 0; i < beeps; i++) {
                beep_pattern(1);
                Delay(100);
            }
            USART_Printf("Beep x%d\r\n", beeps);
        } else {
            USART_SendString("Beep count: 1-10\r\n");
        }
    }
    
    else if (strncmp(cmd_copy, "buzzer", 6) == 0) {
        const char* param = command + 6;
        while (*param == ' ') param++;
        int pattern = atoi(param);
        if (pattern > 0 && pattern <= 10) {
            beep_pattern(pattern);
            USART_Printf("Buzzer pattern: %d\r\n", pattern);
        } else {
            USART_SendString("Buzzer pattern: 1-10\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "reset") == 0) {
        USART_SendString("System reset in 1 second...\r\n");
        Delay(1000);
        NVIC_SystemReset();
    }
    
    else {
        USART_Printf("Unknown command: '%s'\r\n", command);
        USART_SendString("Type 'help' for available commands\r\n");
    }
}

// ============================================
// 中断处理函数
// ============================================

/**
 * @brief USART2 中断处理 (调试串口)
 */
void USART2_IRQHandler(void) {
    if (usart_interrupt_flag_get(DEBUG_USART, USART_INT_FLAG_RBNE) != RESET) {
        uint8_t ch = usart_data_receive(DEBUG_USART);
        process_received_char(ch);
        usart_interrupt_flag_clear(DEBUG_USART, USART_INT_FLAG_RBNE);
    }
    
    if (usart_interrupt_flag_get(DEBUG_USART, USART_INT_FLAG_TC) != RESET) {
        usart_interrupt_flag_clear(DEBUG_USART, USART_INT_FLAG_TC);
    }
}

// ============================================
// 重定向printf到串口
// ============================================

#ifdef __GNUC__
// 对于GCC编译器
int _write(int file, char *ptr, int len) {
    (void)file;
    USART_SendData((uint8_t*)ptr, len);
    return len;
}
#else
// 对于其他编译器
int fputc(int ch, FILE *f) {
    (void)f;
    usart_data_transmit(DEBUG_USART, (uint8_t)ch);
    while (usart_flag_get(DEBUG_USART, USART_FLAG_TBE) == RESET);
    return ch;
}
#endif